Revit 2027 API
TableCellStyleOverrideOptions.TextOrientation Property
 Indicates if the text orientation characteristic is overridden.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool TextOrientation { get; set; }
Public Property TextOrientation As Boolean
	Get
	Set
public:
property bool TextOrientation {
	bool get ();
	void set (bool value);
}
member TextOrientation : bool with get, set
Property Value
Boolean
See Also
Reference
TableCellStyleOverrideOptions Class
Autodesk.Revit.DB Namespace